insert into "Model" ("Id", "ModelTitle", "EngineVolume", "MaxSpeed", "DoorCount", "PlaceCount") values 
(default, 'Model-1', 3.4, 152, 4, 5), 
(default, 'Model-2', 3.4, 235, 4, 8), 
(default, 'Model-3', 3.8, 327, 4, 8), 
(default, 'Model-4', 2.2, 308, 4, 5), 
(default, 'Model-5', 3.1, 120, 4, 5), 
(default, 'Model-6', 2.5, 129, 2, 5), 
(default, 'Model-7', 1.5, 110, 4, 5), 
(default, 'Model-8', 2.4, 135, 4, 5), 
(default, 'Model-9', 3.4, 278, 4, 8), 
(default, 'Model-10', 1.9, 198, 2, 8), 
(default, 'Model-11', 3.8, 316, 4, 5), 
(default, 'Model-12', 3.3, 333, 2, 8), 
(default, 'Model-13', 2.4, 346, 2, 5), 
(default, 'Model-14', 2.8, 343, 4, 5), 
(default, 'Model-15', 3.6, 187, 4, 8) ;

-- Заполняем таблицу Color
 insert into "Color" ("Id", "ColorTitle") values  
(default, 'Красный'), 
(default, 'Синий'), 
(default, 'Желтый'), 
(default, 'Лиловый'), 
(default, 'Сербурмалиновый'), 
(default, 'Фиолетовый'), 
(default, 'Изумрудный'), 
(default, 'Черный'), 
(default, 'Белый') ;

-- Заполняем таблицу Car
 insert into "Car" ("Id", "ModelId", "TransmissionCode", "RegNumber", "BodyCode", "EngineCode", "ReleaseDate", "ColorId") values 
(default, 10, 'KO03V', 'к391ел', 'R2D3O', '9BCVT', '1999-05-08', 3), 
(default, 10, 'MKK2F', 'е602ен', 'ABAPP', 'XG99-', '2001-07-24', 3), 
(default, 5, 'J2JFP', 'л347но', '3FLYK', 'Q66KA', '2002-04-16', 4), 
(default, 3, 'R5SED', 'а961ае', '7NJ2Z', 'CR2KU', '2001-06-20', 2), 
(default, 10, 'SI-4-', 'в247ал', '1APQR', '9-N88', '1999-04-01', 5), 
(default, 12, 'YZXG6', 'н664ек', 'U6IF1', '6QXMV', '2001-06-05', 3), 
(default, 6, 'TLGAU', 'о762ен', '5MEGT', 'OKNML', '2000-11-22', 5), 
(default, 9, '-J6U-', 'а659оа', 'LEOQK', 'DW-WN', '2001-01-31', 2), 
(default, 9, '7HYOY', 'л244мн', '0CXGE', 'L3VC5', '1999-07-01', 3), 
(default, 6, 'RG01T', 'в364мк', 'BNMVG', 'RSXPL', '2000-05-07', 1), 
(default, 8, 'JHGVN', 'е671нк', 'WU2UA', 'KN61X', '1999-05-26', 1), 
(default, 3, '35JJ4', 'о115ло', 'GDNMD', 'ZUPLK', '1999-02-01', 4), 
(default, 11, 'QK-2A', 'о611нм', 'CKB08', '1L-98', '2000-12-27', 5), 
(default, 6, 'K6Z56', 'о493аа', 'QOA1V', 'CYOT6', '2002-05-31', 4), 
(default, 9, '2-SIP', 'л982ов', 'Z68IR', 'QCFI9', '1998-08-01', 4) ;

-- Заполняем таблицу Employees
 insert into "Employees" ("Id", "LastName", "Name", "Patronymic", "Birthday", "Phone") values  
(default, 'Михайлов', 'Алексей', 'Сергеевич', '1992-09-03', '+79688259137'), 
(default, 'Сергеев', 'Алексей', 'Иванович', '1989-09-11', '+79554721619'), 
(default, 'Иванов', 'Иван', 'Сергеевич', '1988-11-02', '+79378857553'), 
(default, 'Сергеев', 'Сергей', 'Алексеевич', '1989-05-21', '+79291861891'), 
(default, 'Алексеев', 'Алексей', 'Иванович', '1988-01-23', '+79604080206'), 
(default, 'Михайлов', 'Иван', 'Алексеевич', '1991-03-25', '+79273962857'), 
(default, 'Алексеев', 'Сергей', 'Иванович', '1991-12-25', '+79598372656'), 
(default, 'Михайлов', 'Иван', 'Алексеевич', '1989-03-10', '+79410112940'), 
(default, 'Михайлов', 'Алексей', 'Алексеевич', '1988-05-17', '+79292806314'), 
(default, 'Алексеев', 'Алексей', 'Михайлович', '1990-10-11', '+79711574751'), 
(default, 'Михайлов', 'Сергей', 'Алексеевич', '1992-02-10', '+79273439229'), 
(default, 'Иванов', 'Сергей', 'Алексеевич', '1988-06-02', '+79238010509'), 
(default, 'Михайлов', 'Алексей', 'Иванович', '1989-01-01', '+79734821543'), 
(default, 'Сергеев', 'Алексей', 'Сергеевич', '1991-08-17', '+79510049686'), 
(default, 'Алексеев', 'Сергей', 'Алексеевич', '1991-11-09', '+79347943774') ;

-- Заполняем таблицу Customer
 insert into "Customer" ("Id", "LastName", "Name", "Patronymic", "CustomerTitle", "PassportData", "Phone") values  
(default, 'Михайлов', 'Сергей', 'Михайлович', 'ООО БД', 2235044276, '+79664921844'), 
(default, 'Михайлов', 'Сергей', 'Сергеевич', '', 9742304406, '+79808194043'), 
(default, 'Иванов', 'Сергей', 'Иванович', 'ООО БД', 4811757242, '+79679182325'), 
(default, 'Сергеев', 'Алексей', 'Сергеевич', '', 1432044700, '+79373020345'), 
(default, 'Сергеев', 'Сергей', 'Алексеевич', '', 2776083731, '+79708683224'), 
(default, 'Михайлов', 'Алексей', 'Иванович', 'ООО БД', 3060120577, '+79383279976'), 
(default, 'Алексеев', 'Иван', 'Михайлович', '', 7952809433, '+79834670871'), 
(default, 'Михайлов', 'Алексей', 'Михайлович', 'ООО Канарейка', 4357168646, '+79141147526'), 
(default, 'Алексеев', 'Алексей', 'Иванович', 'ООО Канарейка', 1931075513, '+79668192059'), 
(default, 'Сергеев', 'Михаил', 'Иванович', 'ООО БД', 7285521429, '+79547540769'), 
(default, 'Иванов', 'Алексей', 'Сергеевич', 'ООО Компания', 6162963107, '+79467210908'), 
(default, 'Сергеев', 'Сергей', 'Иванович', '', 1271885301, '+79431006949'), 
(default, 'Сергеев', 'Сергей', 'Алексеевич', 'ООО БД', 6760370925, '+79769959803'), 
(default, 'Михайлов', 'Сергей', 'Михайлович', 'ООО Канарейка', 7634181395, '+79140733524'), 
(default, 'Иванов', 'Михаил', 'Михайлович', 'ООО Канарейка', 2152771253, '+79606584181') ;

-- Заполняем таблицу AdditionalServices
 insert into "AdditionalServices" ("Id", "Title", "PricePerDay") values  
(default, 'Очистка Окон', 438), 
(default, 'Полировка Кресел', 108), 
(default, 'Очистка Окон', 781), 
(default, 'Полировка Кресел', 520), 
(default, 'Улучшение Окон', 852), 
(default, 'Полировка Кресел', 798), 
(default, 'Очистка Руля', 165), 
(default, 'Улучшение Кресел', 548), 
(default, 'Улучшение Окон', 33), 
(default, 'Очистка Кресел', 54), 
(default, 'Полировка Руля', 96), 
(default, 'Улучшение Руля', 429), 
(default, 'Улучшение Руля', 657), 
(default, 'Полировка Кресел', 491), 
(default, 'Полировка Окон', 458) ;

-- Заполняем таблицу Contracts 
 insert into "Contract" ("Id", "CustomerId", "EmployeeId", "CarId", "BeginDate", "DayCount", "ServiceId", "Cost") values  
(default, 13, 3, 6, '2023-04-10', 26, 11, 41427), 
(default, 15, 2, 10, '2023-04-03', 22, 14, 28083), 
(default, 3, 13, 10, '2023-03-22', 19, 1, 17124), 
(default, 8, 9, 13, '2023-03-30', 27, 12, 31633), 
(default, 13, 1, 4, '2023-04-03', 8, 2, 19700), 
(default, 1, 7, 15, '2023-04-07', 24, 15, 19686), 
(default, 6, 1, 1, '2023-04-04', 5, 14, 43784), 
(default, 5, 13, 9, '2023-04-05', 16, 2, 34542), 
(default, 14, 15, 5, '2023-04-06', 11, 4, 1415), 
(default, 7, 11, 14, '2023-03-27', 21, 2, 16264), 
(default, 15, 9, 10, '2023-03-24', 1, 4, 2241), 
(default, 1, 14, 7, '2023-03-31', 1, 4, 36131), 
(default, 15, 9, 9, '2023-04-05', 5, 7, 47631), 
(default, 3, 11, 4, '2023-04-03', 6, 11, 8818), 
(default, 6, 7, 10, '2023-04-16', 12, 9, 49892) ;

--Обновляем таблицу Color
 
update "Color"
set "ColorTitle" = 'Бирюзовый'
where "ColorId" = 1


--Удаляем столбец

alter table "Color"
    drop column "ColorTitle"
 
